Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: དགེ་སློང་དག་བྱང་ཆུབ་སེམས་དཔས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་མ་ཐག་ཏུ་དེ་ནས་སྐད་ཅིག་དེ་ཉིད་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སེམས་ཅན་ཐམས་ཅད་སྐད་ཅིག་དེ་དང་། ཐང་ཅིག་དེ་དང་། ཡུད་ཙམ་དེ་ལ་མཆོག་ཏུ་བདེ་བ་དང་ལྡན་པར་གྱུར་ཏོ།
en: Monks, indeed, the very moment that the Bodhisattva attained omniscience, all beings throughout all the worlds in the ten directions instantly became ecstatic.

source: །འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱང་སྣང་བ་ཆེན་པོས་སྣང་བར་བྱས་ནས། འཇིག་རྟེན་གྱི་བར་སྡིག་པ་སྡིག་པས་ཁྱབ་པ་མུན་ནག་ཅེས་བྱ་བ་སྔ་མ་བཞིན་ནོ།
en: All the worlds were flooded with bright light, including even the dark spaces between them that were riddled with evil.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་རྣམ་པ་དྲུག་ཏུ་གཡོས།
en: All the worlds throughout the ten directions shook in six ways:

source: རབ་ཏུ་གཡོས། ཀུན་ཏུ་རབ་ཏུ་གཡོས་སོ། །ལྡེག །རབ་ཏུ་ལྡེག། །ཀུན་ཏུ་རབ་ཏུ་ལྡེག་གོ །འགུལ། རབ་ཏུ་འགུལ། ཀུན་ཏུ་རབ་ཏུ་འགུལ་ཏོ། །འཁྲུགས། རབ་ཏུ་འཁྲུགས། ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས་སོ། །ཆེམ་ཆེམ། རབ་ཏུ་ཆེམ་ཆེམ། ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ། །འུར་འུར། རབ་ཏུ་འུར་འུར། ཀུན་ཏུ་རབ་ཏུ་འུར་འུར་རོ།
en: they quivered, trembled, and quaked, wobbled, rocked, and swayed; they vibrated, shuddered, and reeled, rattled, shook, and convulsed; they clattered, rattled, and clanged, boomed, thundered, and roared.

source: །སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཀྱང་དེ་བཞིན་གཤེགས་པ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ། ཆོས་ཀྱི་དགབ་པ་དག་ཀྱང་སྐུར་རོ།
en: All the buddhas offered congratulations to the Thus-Gone One for reaching perfect and complete awakening and conferred upon him religious gifts.

source: །ཆོས་ཀྱི་དགབ་པ་དེ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་རིན་པོ་ཆེའི་གདུགས་གཅིག་གིས་ཁེབས་པར་གྱུར་ཏེ། རིན་པོ་ཆེའི་གདུགས་དེ་ལས་ཀྱང་རྣམ་པ་འདི་ལྟ་བུའི་འོད་ཟེར་གྱི་དྲ་བ་བྱུང་སྟེ།
en: With these religious gifts, this trichiliocosm became covered with a jewel parasol, and from that jewel parasol issued forth a network of light rays, which illuminated the immeasurable and innumerable worlds throughout the ten directions.

source: དེ་དག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་སྣང་བར་བྱས་ནས་ཕྱོགས་བཅུའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དང་། ལྷའི་བུ་རྣམས་ཀྱང་ཀུན་དགའ་བའི་སྒྲ་རྗོད་པར་གྱུར་ཏེ།
en: Then the bodhisattvas and gods throughout the ten directions uttered an expression of joy:

source: སེམས་ཅན་མཁས་པའི་པད་མ་ཡེ་ཤེས་ཀྱི་མཚོ་ལས་བྱུང་བ།
en: “An adept among beings, a lotus on the lake of wisdom, has appeared.

source: འཇིག་རྟེན་གྱི་ཆོས་རྣམས་ཀྱིས་མ་གོས་པ་བྱུང་ངོ་།
en: Untainted by mundane concerns,

source: །ཐུགས་རྗེ་ཆེན་པོའི་སྤྲིན་ཡང་དག་པར་འཕགས་ཏེ།
en: He will cause a cloud of great compassion to mass,

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་གནས་ཁྱབ་པར་མཛད་ནས།
en: Which will shower throughout the realm of phenomena.

source: འདུལ་བའི་སྐྱེ་བོའི་སྨན་གྱི་ཆོས་ཀྱི་ཆར།
en: “The gentle rain of Dharma, medicine to living beings,

source: དགེ་བའི་རྩ་བའི་ས་བོན་ཐམས་ཅད་ཀྱི་མྱུ་གུ་སྐྱེད་པ།
en: Will cause all the seeds of the roots of virtue to sprout,

source: དད་པའི་མྱུ་གུ་རྣམས་རྣམ་པར་འཕེལ་བར་བྱེད་པ།
en: Bring growth to the saplings of faith,

source: རྣམ་པར་གྲོལ་བའི་འབྲས་བུ་རྣམས་འབྱིན་པར་བྱེད་པའི་ཆར་འབེབས་པར་འགྱུར་རོ་ཞེས་འཛེར་ཏོ།
en: And yield the fruits of liberation.”

source: སྐྱེས་བུ་སེང་གེ་དེ་ཡིས་དཔུང་བཅས་བདུད་བཏུལ་ཏེ།
en: Since he defeated Māra, along with his hordes, he is indeed a lion among men.

source: །སྟོན་པས་བསམ་གཏན་བདེ་བ་མངོན་དུ་མཛད་ནས་ནི།
en: When this teacher actualized the bliss of concentration

source: །གང་ཚེ་སྟོབས་བཅུས་རིག་པ་གསུམ་པོ་མཉེས་གྱུར་ཚེ།
en: And attained the threefold knowledge by means of the tenfold power,

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཞིང་མང་བྱེ་བ་གཡོས་པར་གྱུར།
en: Many tens of millions of buddha realms throughout the ten directions trembled.

source: །ཆོས་འདོད་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་ཡོངས་ལྷགས་པ།
en: Those bodhisattvas who had previously come desiring the Dharma

source: །ཞབས་ལ་གཏུགས་ཏེ་འདི་སྐད་ཚིག་སྨྲས་མ་མཉེལ་ཏམ།
en: Bowed before his feet and said, “Are you not tired?

source: །བདག་ཅག་མངོན་སུམ་ཅི་འདྲ་ཤིན་ཏུ་འཇིགས་དཔུང་དེ།
en: We have witnessed the army, as terrifying it was,

source: །ཤེས་རབ་བསོད་ནམས་སྟོབས་དང་བརྩོན་འགྲུས་སྟོབས་ཀྱིས་བཅོམ།
en: Vanquished by the strength of your insight, merit, and diligence.”

source: །ཁྲག་ཁྲིག་ཞིང་ནས་སངས་རྒྱས་རྣམས་ཀྱིས་གདུགས་རྣམས་བསྐུར།
en: Parasols were carried by the buddhas of one hundred billion realms, Who said,

source: །དེས་པ་སྐྱེས་བུ་ཆེན་པོ་བདུད་ཀྱི་སྡེ་རྣམས་བཏུལ།
en: “Well done, Great Being! You overpowered the demonic hordes

source: །ཁྱེད་ཀྱིས་གནས་མཆོག་འཆི་མེད་མྱ་ངན་མེད་པ་བརྙེས།
en: And attained the sublime state, deathless and free of anguish.

source: །སྲིད་པ་གསུམ་དུ་དམ་ཆོས་ཆར་པ་མྱུར་དུ་ཕོབ།
en: Swiftly shower down the rain of true Dharma throughout the three worlds.”

source: །ཕྱོགས་བཅུའི་སེམས་ཅན་སྙིང་པོ་རྣམས་ཀྱིས་ཕྱག་བརྐྱང་སྟེ།
en: The best of beings throughout the ten directions extended their arms

source: །ཀ་ལ་པིང་ཀའི་སྒྲ་ཡི་གསུང་དུ་བརྗོད་པ་ནི།
en: And said in the voice of a cuckoo’s call,

source: །བདག་ཅག་ཇི་ལྟར་བྱང་ཆུབ་ཐོབ་ལྟར་ཁྱོད་སངས་རྒྱས།
en: “Just as we attained awakening, you too have reached the pristine state;

source: །དཔེར་ན་མར་དང་མར་གྱི་སྙིང་ཁུ་མཚུངས་འདྲ་བཞིན། །
en: We are just like butter and clarified butter.”

source: དགེ་སློང་དག་དེ་ནས་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་བུ་མོ་དག་གིས་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པ་མངོན་པར་ཤེས་པ་བརྙེས་པ་དང་། །བརྣག་པ་ཡོངས་སུ་རྫོགས་པ་དང་། གཡུལ་ལས་རྣམ་པར་རྒྱལ་བ་དང་། བདུད་ཕྱིར་རྒོལ་བ་ཕམ་པར་མཛད་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་བསྒྲེང་བ་དང་། དཔའ་བ་དང་། རྒྱལ་བ་འཕགས་པ་དང་། སྐྱེས་བུ་དང་། སྐྱེས་བུ་ཆེན་པོ་དང་། སྨན་པའི་མཆོག་དང་། ཟུག་རྔུ་འབྱིན་པ་ཆེན་པོ་དང་། སེང་གེ་ལྟར་མི་བསྙེངས་ཤིང་སྤུ་ཟིང་ཞེས་བྱེད་པ་མི་མངའ་བ་དང་། གླང་པོ་ལྟར་ཐུགས་ཤིན་ཏུ་དུལ་བ་དང་། དྲི་མ་གསུམ་སྤངས་པས་དྲི་མ་མི་མངའ་བ་དང་། རིག་པ་གསུམ་བརྙེས་པས་མཁྱེན་པ་པོ་དང་། ཆུ་བོ་བཞི་ལས་བརྒལ་བས་ཕ་རོལ་ཏུ་བྱོན་པ་དང་། རིན་པོ་ཆེའི་གདུགས་གཅིག་འཛིན་པས་རྒྱལ་རིགས་སུ་གྱུར་པ་དང་། སྡིག་པའི་ཆོས་སྤངས་པས་འཇིག་རྟེན་གསུམ་གྱི་བྲམ་ཟེར་གྱུར་པ་དང་། མ་རིག་པའི་སྒོ་ངའི་སྦུབས་བཅོམ་པས་དགེ་སློང་དུ་གྱུར་པ་དང་། ཆགས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པས་དགེ་སྦྱོང་དུ་གྱུར་པ་དང་། ཉོན་མོངས་པ་བསལ་བས་གཙང་སྦྲ་ཅན་དུ་གྱུར་པ་དང་། རྒྱལ་མཚན་མ་བསྙལ་བས་དཔའ་བ་དང་། སྟོབས་བཅུ་མངའ་བའི་ཤིན་ཏུ་སྟོབས་དང་ལྡན་པ་དང་། རིན་པོ་ཆེའི་འབྱུང་གནས་ལྟར་ཆོས་རིན་པོ་ཆེ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་རིག་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལོགས་སུ་ཕྱོགས་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ། །
en: Then the goddesses of the desire realm perceived that the Thus-Gone One on the seat of awakening had attained higher knowledge, fulfilled his purpose, and become victorious in battle. He had vanquished the demonic opponents, raised parasols, standards, and flags, and become a hero, a supreme victor, a man, a great man, a supreme physician, and a great remover of thorns. Like a lion, he was fearless and without worry. Like an elephant, he was gentle. Since he had relinquished the three stains, he was stainless. He was knowledgeable, since he had actualized the threefold knowledge. He had reached the other shore, since he had crossed the four rivers. He was of royal caste since he upheld the single jewel parasol, a priest of the three worlds since he had abandoned evil actions, a mendicant since he has cracked open the eggshell of ignorance, an ascetic since he had perfectly transcended all attachment, a gentleman since he had eradicated afflictions, a hero since he did not let the banner fall, a powerhouse since he was endowed with the ten powers, a jewel mine since he was replete with all the gems of the Dharma. Knowing this, the goddesses approached the seat of awakening and praised the Thus-Gone One with these verses:

source: འདི་ནི་ཤིང་གི་རྒྱལ་དྲུང་དུ། །བདུད་སྡེ་མངོན་དུ་ཕམ་མཛད་ནས།
en: “Having defeated the demon hordes At the trunk of the king of trees,

source: །རི་རབ་ལྟ་བུར་མི་གཡོ་བཞུགས།
en: He sits there unshakable like Mount Meru,

source: །བསྙེངས་པ་མི་མངའ་འབྲོས་མི་མཛད།
en: Fearless and silent.

source: །འདིས་ནི་བསྐལ་པ་བྱེ་མང་དུ། །སྦྱིན་དང་དུལ་དང་སྡོམ་པ་ཡིས།
en: “Through practicing generosity, discipline, and restraint For many tens of millions of eons,

source: །བྱང་ཆུབ་དམ་པ་ཡང་དག་བསྒྲུབས།
en: He attained perfect sublime awakening

source: །དེས་ན་འདིར་ནི་དོ་མོད་མཛེས།
en: And therefore shines here today.

source: །བྱང་ཆུབ་དམ་པ་ཚོལ་བ་ན།
en: “Through practicing discipline, vows, and austerities

source: །འདི་ཡིས་བསྐལ་པ་བྱེ་མང་དུ།
en: For many tens of millions of eons

source: །ཚུལ་ཁྲིམས་བརྟུལ་ཞུགས་དཀའ་ཐུབ་ཀྱིས།
en: While seeking awakening,

source: །བརྒྱ་བྱིན་ཚངས་པ་ཟིལ་དུ་བརླག
en: He outshines Śakra and Brahmā.

source: །འདི་ཡིས་བསྐལ་པ་བྱེ་མང་དུ། །བཟོད་པའི་སྟོབས་ཀྱི་གོ་མནབས་ཏེ།
en: “Through wearing the strong armor of forbearance For many tens of millions of eons,

source: །སྡུག་བསྔལ་རྣམས་ནི་དང་དུ་བླངས།
en: He embraced suffering

source: །དེས་ན་གསེར་མདོག་འོད་དང་ལྡན།
en: And therefore shines like gold.

source: །འདི་ཡིས་བསྐལ་པ་བྱེ་མང་དུ། །བརྩོན་འགྲུས་སྟོབས་དང་རྩལ་གྱིས་ནི།
en: “Through the strength and intensity of his valor Over many tens of millions of eons,

source: །གཞན་དག་ཕྱིར་བསྙིལ་མཛད་མཛད་དེ།
en: He drove away his opponents

source: །དེས་ན་བདུད་ཀྱི་སྡེ་ལས་རྒྱལ།
en: And thus triumphed over Māra’s army.

source: །འདི་ཡིས་བསྐལ་པ་བྱེ་མང་དུ། །བསམ་གཏན་མངོན་ཤེས་ཡེ་ཤེས་ཀྱིས།
en: “Through his concentration, higher knowledge, and wisdom Enacted over many tens of millions of eons,

source: །ཐུབ་པའི་དབང་པོ་ཡང་དག་མཆོད།
en: He revered the best of sages

source: །དེས་ན་དོ་མོད་འདི་ལ་མཆོད། །འདི་ཡིས་བསྐལ་པ་བྱེ་མང་དུ། །ཤེས་རབ་དང་ནི་གསན་པ་བསགས།
en: And is therefore honored now himself. “Through his insight, learning, and accumulations, Developed over the course of tens of millions of eons,

source: །སེམས་ཅན་བྱེ་བ་ཕན་ཡང་བཏགས།
en: He has benefited tens of millions of sentient beings

source: །དེས་ན་བྱང་ཆུབ་མྱུར་དུ་བརྙེས།
en: And thus swiftly attained awakening.

source: །འཆི་བདག་ཉོན་མོངས་བདུད་ལས་རྒྱལ།
en: And likewise over the lord of death and the demon of afflictions.

source: །འདི་ནི་ལྷ་ཡི་བདུད་ལས་རྒྱལ།
en: He has also triumphed over the demon of the gods—

source: །དེས་འདི་མྱ་ངན་མི་འདའོ།
en: Thus he has no anguish.

source: །འདི་ནི་ཤིན་ཏུ་ལྷ་ཡི་ལྷ།
en: “This god of gods,

source: །ལྷ་རྣམས་ཀྱིས་ཀྱང་མཆོད་པའི་ཆ།
en: Revered even by the gods,

source: །འཇིག་རྟེན་གསུམ་ན་མཆོད་པའི་འོས།
en: Is worthy of reverence throughout the three worlds

source: །བསོད་ནམས་དོན་དུ་གཉེར་བའི་ཞིང་།
en: As a field for those seeking merit.

source: །འཆི་མེད་འབྲས་བུ་སྦྱིན་མཛད་པ།
en: “He yields the fruit of immortality;

source: །འདི་ནི་སྦྱིན་གནས་དམ་པ་སྟེ།
en: He is a sublime object of veneration.

source: །འདི་ལ་སྦྱིན་པ་བཏང་ན་དེ།
en: When a donation is given to him, the result is never-ending

source: །བྱང་ཆུབ་དམ་པ་ཐོབ་བར་དུ།
en: Until the attainment of supreme awakening.

source: །བར་མ་དོར་ནི་ཆུད་མི་ཟ།
en: “The hair between his eyebrows radiates light,

source: །འདི་ཡི་མཛོད་སྤུ་མཛེས་པ་ཡིས།
en: Illuminating many tens of millions of locales.

source: །ཞིང་མང་བྱེ་བ་གསལ་བར་བགྱིད། །ཉི་ཟླ་དག་ཀྱང་ཟིལ་དུ་རླག །སེམས་ཅན་རྣམས་ལ་སྣང་བར་གྱུར།
en: Outshining even the sun and the moon, He is a light unto all sentient beings.

source: །འདི་ཡི་གཟུགས་ནི་གཟུགས་མཛེས་ཏེ།
en: “His form is handsome—

source: །གཟུགས་ཀྱི་དམ་པ་ལེགས་པའི་གཟུགས།
en: Sublime and well-proportioned.

source: །མཚན་མཆོག་མངའ་ཞིང་ཕན་པ་བཞེད། །འཇིག་རྟེན་གསུམ་ན་མཆོད་པའི་འོས། །
en: Replete with the best of characteristics and poised to be of benefit, It is worthy of reverence throughout the three worlds.

source: འདི་སྤྱན་ཤིན་ཏུ་རྣམ་དག་སྟེ། །ཞིང་རྣམས་དང་ནི་སེམས་ཅན་ཚོགས། །སེམས་དང་ལྡན་དང་སེམས་མེད་པ།
en: “His eyes are pristine: They spontaneously see The myriad insentient and sentient,

source: །མང་པོ་དག་ལ་རང་བྱུང་གཟིགས།
en: The locales and multitudes of beings.

source: །འདི་སྙན་ཤིན་ཏུ་རྣམ་དག་སྟེ།
en: “His ears are pristine:

source: །ལྷ་ཡི་དག་དང་མི་ཡི་དང་། །རྒྱལ་བ་རྣམས་ཀྱི་ཆོས་ཀྱི་དང་། །མཐའ་ཡས་པ་ཡི་སྒྲ་རྣམས་གསན།
en: They hear infinite sounds, Those of gods and humans And those of the victorious ones’ Dharma.

source: །འདི་ཡི་ལྗགས་ནི་ཡངས་པ་སྟེ།
en: “His tongue is long

source: །ཀ་ལ་པིང་ཀ་འཇམ་པའི་དབྱངས། །
en: And as melodious as a cuckoo’s voice.

source: འཆི་མེད་རབ་ཏུ་ཞིར་འགྲོ་བའི། །ཆོས་ནི་འདི་ལས་བདག་ཅག་མཉན།
en: Let us listen to him speak about the Dharma, An ambrosia that brings great peace.

source: །བདུད་ཀྱི་སྡེ་རྣམས་གཟིགས་གྱུར་ཀྱང་།
en: “Even witnessing Māra’s army,

source: །དེ་ཡི་ཐུགས་ནི་འཁྲུགས་མི་མངའ།
en: His mind is unperturbed.

source: །ལྷ་ཡི་ཚོགས་རྣམས་གཟིགས་གྱུར་ཀྱང་།
en: Even seeing the multitudes of gods,

source: །ཤིན་ཏུ་ཐུགས་གཞུངས་དགྱེས་མི་མངའ།
en: His sensible mind is not ecstatic.

source: །འདི་ཡིས་མཚོན་དང་མདའ་རྣམས་ཀྱིས། །བདུད་ཀྱི་སྡེ་ལས་རྒྱལ་མ་ལགས།
en: “It was not with knives and arrows That he defeated Māra’s army.

source: །བདེན་པ་བརྟུལ་ཞུགས་དཀའ་ཐུབ་ཀྱིས།
en: Rather it was with truth, restraint, and austerity

source: །སྡང་བའི་གྱད་ལས་འདི་རྒྱལ་ལོ།
en: That he overcame the villainous thugs.

source: །གདན་ལས་མ་བསྐྱོད་བཞིན་དུ་ནི།
en: “Without being displaced from his seat,

source: །དེ་ཡི་སྐུ་ལ་གནོད་མ་བྱུང་།
en: His body was unharmed.

source: །དེ་ཡི་སྐབས་སུ་བྱམས་མི་མངའ།
en: On that occasion he was neither affectionate

source: །ཞེ་སྡང་གྱུར་པའང་མ་ལགས་སོ།
en: Nor even angry.

source: །གང་དག་ཁྱོད་ལས་ཆོས་ཐོས་ནས། །སྒྲུབ་པ་བགྱིད་པར་འཚལ་བ་ཡི། །ལྷ་དང་མི་རྣམས་དེ་དག་ནི། །རྙེད་པ་ལེགས་པར་རྙེད་པ་ལགས།
en: “Those gods and humans Who listen to the Dharma from you, And strive to accomplish it, Procure their desired acquisition.

source: །རྒྱལ་བ་བསོད་ནམས་གཟི་མངའ་བ། །ཁྱོད་ལ་བསྟོད་པའི་བསོད་ནམས་ཀྱིས། །མི་ཡི་ཟླ་བ་ཁྱོད་འདྲ་བར། །ཀུན་ཀྱང་མྱུར་དུ་འགྱུར་བར་ཤོག །
en: “Through the merit of praising you, O Victorious One, replete with the resplendence of merit, May we all immediately become like you, O Moon among Men!”

source: སྐྱེས་བུ་ཁྱུ་མཆོག་འདྲེན་པས་བྱང་ཆུབ་སངས་རྒྱས་ནས།
en: Once the guide, a bull among men, had awakened to buddhahood,

source: །ཁྲག་ཁྲིག་ཞིང་རྣམས་བསྐྱོད་ཅིང་བདུད་ཀྱང་ཕམ་མཛད་དེ།
en: Hundreds of billions of realms trembled and Māra was vanquished.

source: །འདྲེན་པས་ཐོག་མར་ཚིགས་སུ་བཅད་པ་འདི་གསུངས་སོ།
en: The Guide first spoke these verses:

source: །བསོད་ནམས་རྣམ་སྨིན་བདེ་སྟེ་སྡུག་བསྔལ་ཐམས་ཅད་སེལ།
en: “Merit, fully ripened, brings happiness and vanquishes all suffering.

source: །བསོད་ནམས་ལྡན་པའི་མི་ཡི་བསམ་པ་རྣམས་ཀྱང་འགྲུབ།
en: The wishes of a person with merit will be accomplished;

source: །བདུད་བཅོམ་ནས་ནི་བྱང་ཆུབ་མྱུར་དུ་རེག་པར་འགྱུར།
en: They will overcome Māra, quickly reach awakening,

source: །མྱ་ངན་འདས་པ་ཞི་བ་བསིལ་བའི་དངོས་པོ་ཐོབ།
en: And attain nirvāṇa, the tranquil state of peace.

source: །དེ་བས་བསོད་ནམས་བྱ་བས་ཆོག་པར་སུ་ཞིག་འཛིན།
en: “Thus who could get their fill of making merit?

source: །བདུད་རྩི་ཆོས་མཉན་པས་ཀྱང་ཆོག་པར་སུ་ཞིག་འཛིན།
en: Who could be satiated with listening to ambrosia-like Dharma?

source: །སྐྱེ་བོ་མེད་པའི་ནགས་གནས་ཆོག་པར་སུ་ཞིག་འཛིན།
en: Who could get enough of dwelling in deserted forests?

source: །སེམས་ཅན་དོན་བྱ་བས་ཀྱང་ཆོག་པར་སུ་ཞིག་འཛིན།
en: Who could get enough of working for the welfare of beings?”

source: །བྱང་ཆུབ་སེམས་དཔས་ལག་པ་བརྐྱང་སྟེ་ཚིག་བརྗོད་པ།
en: Extending his hand, he said to the bodhisattvas:

source: །མཆོད་པ་བྱས་ཀྱིས་རང་རང་དག་གི་ཞིང་དུ་དེང་།
en: “Respect has been paid, thus return to your own places.”

source: །ཀུན་གྱིས་དེ་བཞིན་གཤེགས་པའི་ཞབས་ལ་ཕྱག་འཚལ་ནས།
en: All of them bowed to the feet of the Thus-Gone One

source: །སྣ་ཚོགས་བཀོད་པས་རང་རང་དག་གི་ཞིང་དུ་དོང་།
en: And returned to their own abodes, in magnificent arrays.

source: །དཔུང་རྣམས་ཕན་ཚུན་ཆེན་པོ་བྱུང་བ་དེ་གཟིགས་ནས།
en: After witnessing the great demonic horde advancing

source: །བདེ་བར་གཤེགས་པ་ཚུལ་དུ་ཤིས་པར་རྣམ་པར་རོལ།
en: And the Well-Gone One toying auspiciously with them,

source: །དཔུང་བཅས་བདུད་ལས་རྒྱལ་ཏེ་བདུད་རྩི་རེག་ཤོག་ཅེས། །སེམས་ཅན་རྣམས་ཀྱིས་མཚུངས་མེད་སེམས་ཀྱིས་བྱང་ཆུབ་སྨོན།
en: Beings, out of an unparalleled wish to reach awakening, said: “May we vanquish Māra and his horde, and thus reach the deathless state.”

source: །དགེ་སློང་དག་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་ན་སེང་གེའི་གདན་ལ་བཞུགས་ཏེ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས། སྐད་ཅིག་དེ་ལ་སངས་རྒྱས་ཀྱི་རྣམ་པར་རོལ་པ་དཔག་ཏུ་མེད་པ་མཛད་དེ། དེ་དག་ནི་བསྐལ་པར་ཡང་བསྟན་པར་སླ་བ་མ་ཡིན་ནོ།
en: Monks, even while the Thus-Gone One reached perfect and complete awakening seated on his lion’s throne at the trunk of the tree of awakening, he simultaneously manifested such innumerable displays of awakened playful activity that they would not be easy to reveal even in an eon.

source: ས་ནི་ལག་མཐིལ་ལྟ་བུར་མཉམ་པར་གནས་པར་གྱུར།
en: The earth became as even as the palm of a hand;

source: འདབ་མ་བརྒྱ་པ་རྒྱས་པ་འོད་དང་ལྡན་པ་བྱུང་།
en: Hundred-petaled lotuses in full bloom arose in a flood of light.

source: ལྷ་རྣམས་བརྒྱ་སྟོང་བྱང་ཆུབ་སྙིང་པོར་རབ་ཏུ་འདུད།
en: Hundreds of thousands of gods bowed down to the seat of awakening

source: །སེང་གེ་སྒྲ་ཡི་མཚན་མ་དང་པོ་འདི་འདིར་མཐོང་།
en: And witnessed there the One Who Was First Heralded by a Lion’s Roar.

source: །སྟོང་གསུམ་ཤིང་བརྒྱ་དག་དང་རི་རྣམས་དུ་མ་དང་། རི་ཡི་རྒྱལ་པོ་ལྷུན་པོ་བྱང་ཆུབ་སྙིང་པོར་འདུད།
en: Hundreds of trees in the trichiliocosm and also its mountains, Along with Meru, king of mountains, bowed to the seat of awakening.

source: །སྟོབས་བཅུའི་གན་དུ་སོང་སྟེ་བརྒྱ་བྱིན་ཚངས་པ་འདུད།
en: Approaching the one with the ten powers, Brahmā and Śakra paid homage.

source: །འདི་ཡང་མི་ཡི་སེང་གེ་བྱང་ཆུབ་སྙིང་པོར་རོལ།
en: Such was the play of the Lion among Men while at the seat of awakening.

source: །སྐུ་ལས་འོད་ཟེར་བརྒྱ་སྟོང་དག་ནི་རབ་བཀྱེ་སྟེ།
en: Hundreds of thousands of light rays radiated from his body,

source: །རྒྱལ་བའི་ཞིང་མཆོག་ཁྱབ་ནས་ངན་སོང་གསུམ་པོ་ཞི།
en: Pervading the perfect realms of the victorious ones and pacifying the three lower realms.

source: །དེ་ནས་སྐད་ཅིག་ཡུད་ཙམ་མི་ཁོམ་སྐམས་པར་གྱུར།
en: Through this, the unfortunate states were dried up in a mere fraction of an instant,

source: །སེམས་ཅན་གང་ལའང་ཐ་བ་རྒྱགས་སྡང་གནོད་པ་མེད།
en: And hardness, conceit, and hatred were rendered harmless to any sentient being.

source: །འདི་ཡང་མི་ཡི་སེང་གེ་གདན་ལ་བཞུགས་པའི་རོལ།
en: Such was the play of the Lion among Men while he sat in his seat.

source: །ཉི་ཟླ་ནོར་བུ་མེ་དང་གློག་དང་ལྷ་ཡི་འོད། །འོད་དང་ལྡན་པའི་རླབས་ཀྱིས་ཟིལ་མནན་ལམ་མེ་མིན།
en: The resplendent tuft of hair on his forehead Outshone the radiance of the sun, moon, jewels, fire, lightning, and gods,

source: །འགྲོ་བ་གང་གིས་ཀྱང་ནི་སྟོན་པའི་གཙུག་མི་མཐོང་།
en: And the crown of the Teacher’s head was not beheld by any being whatsoever.

source: །ཕྱག་གི་མཐིལ་གྱིས་རེག་ནས་ས་ཡང་རྣམ་དྲུག་གཡོས།
en: By touching the earth with the palm of his hand, it trembled in six ways;

source: །དེ་ཡི་བདུད་ཀྱི་སྡེ་རྣམས་ཤིང་བལ་བཞིན་དུ་དཀྲུགས།
en: This shook Māra’s hordes as if they were tufts of cotton.

source: །བདུད་ནི་མདའ་ཐོགས་ས་ལ་རི་མོ་གང་འདྲི་བ།
en: Māra, brandishing an arrow, etched images in the earth.

source: །འདི་ཡང་མི་ཡི་སེང་གེ་གདན་ལ་རོལ་པ་ལགས།
en: Such was the play of the Lion among Men while he sat in his seat.

source: །མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་ཉི་ཤུ་རྩ་གཉིས་པའོ།། །།
en: This concludes the twenty-second chapter, on perfect and complete awakening.

source: དེ་ནས་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པའི་དེ་བཞིན་གཤེགས་པ་ལ་བསྐོར་བ་བྱས་ཏེ།
en: Then the gods from the pure realms circumambulated the Thus-Gone One, who sat at the seat of awakening.

source: ལྷའི་ཙན་དན་གྱི་ཕྱེ་མའི་ཆར་མངོན་པར་ཕབ་ནས། ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བསྟོད་དོ།
en: They showered him with a rain of divine sandalwood powder and praised him with these fitting verses:

source: །འཇིག་རྟེན་གསལ་བར་མཛད་པ་བྱུང་།
en: “You are a light that has dawned upon this world!

source: །འཇིག་རྟེན་མགོན་པོ་འོད་མཛད་པ།
en: Illuminating Lord of the World,

source: །འཇིག་རྟེན་ལྡོངས་པར་གྱུར་པ་ལ། །ཉོན་མོངས་སྤངས་པ་མིག་སྦྱིན་པ།
en: You have given eyes for abandoning afflictions To this world gone blind!

source: །ཁྱོད་ནི་གཡུལ་ལས་རྣམ་པར་རྒྱལ།
en: “You are victorious in battle!

source: །བསོད་ནམས་དག་གིས་དགོངས་པ་རྫོགས།
en: Through merit you have fulfilled your aim!

source: །དཀར་པོའི་ཆོས་རྣམས་ཀུན་དུ་རྫོགས།
en: Replete with virtuous qualities,

source: །ཁྱོད་ནི་འགྲོ་བ་ཚིམ་མཛད་འགྱུར།
en: You will satisfy beings!

source: །སྡིག་པ་མི་མངའ་འདམ་ལས་རྒལ།
en: “Sinless, you have crossed the mire

source: །གཽ་ཏ་མ་ནི་ཐང་ལ་བཞུགས།
en: And stand on dry ground, O Gautama!

source: །སེམས་ཅན་གཞན་དག་རླུང་ཆེན་གྱིས།
en: You will ferry across other sentient beings,

source: །ཁྱེར་བ་རྣམས་ཀྱང་སྒྲོལ་བར་འགྱུར།
en: Who are carried away by the swift current!

source: །ཤེས་རབ་ཆེན་པོ་ཁྱོད་འཕགས་ཏེ།
en: “Your great insight exalts you!

source: །འཇིག་རྟེན་དག་ན་ཟླ་མ་མཆིས།
en: You are without peer throughout the worlds!

source: །འཇིག་རྟེན་ཆོས་ཀྱིས་ཁྱོད་མི་གོས།
en: You are untainted by mundane concerns,

source: །ཆབ་ན་མཆིས་པའི་པད་མ་བཞིན།
en: Like a lotus floating on water!

source: །འཇིག་རྟེན་རིང་ནས་གཉིད་ལོག་འདི། །མུན་པའི་ཕུང་པོས་གཏིབས་པ་ལ། །ཁྱོད་ནི་ཤེས་རབ་སྒྲོན་མེ་ཡིས། ། རབ་ཏུ་སད་པར་མཛད་པ་སྤྱོད།
en: “With the torch of your insight, You can awaken This long-slumbering world, Shrouded in the fog of darkness!

source: །འཚོ་བའི་འཇིག་རྟེན་རིང་ནས་ནི།
en: “Into the world of the living,

source: །ཉོན་མོངས་ནད་ཀྱིས་གཟིར་བ་ལ། །ནད་རྣམས་ཀུན་ལས་ཐར་མཛད་པ། །སྨན་པའི་རྒྱལ་པོ་ཡང་དག་བྱུང་།
en: Chronically troubled with the disease of afflictions, You have come, O King of Physicians, To cure the world of all illnesses!

source: །འཇིག་རྟེན་མགོན་པོ་ཁྱོད་བྱུང་བས།
en: “Now that you have appeared, O Lord,

source: །མི་ཁོམ་རྣམས་ནི་སྟོངས་པར་འགྱུར།
en: The unfortunate states will become vacant!

source: །ལྷ་རྣམས་དང་ནི་མི་དག་ཀྱང་།
en: Gods and humans

source: །བདེ་བ་རྣམས་དང་ལྡན་པར་འགྱུར།
en: Will become filled with happiness!

source: །སྐྱེས་བུ་ཁྱུ་མཆོག་དེས་པ་ཁྱོད། །ལྟ་བར་གང་དག་འདོང་བགྱིད་པ།
en: “Those who seek to behold you, O Gentle Bull among Men,

source: །དེ་དག་བསྐལ་པ་སྟོང་རྣམས་སུ། །ནམ་ཡང་ངན་འགྲོར་མཆི་མི་འགྱུར།
en: Will never go to the lower realms For thousands of eons!

source: །གང་དག་ཆོས་ཉན་འགྱུར་བ་རྣམས།
en: “Those who listen to the Dharma

source: །དེ་དག་མཁས་ཤིང་ནད་མེད་དང་། །ཟག་དང་ཕུང་པོ་ཟད་པ་དང་། །འཇིགས་པ་མེད་པ་རྣམས་སུ་འགྱུར།
en: Will become scholars and be free of illness. They will be profound and bring an end to the aggregates, And be free from fear!

source: །ཉོན་མོངས་བཅིངས་པ་བཅད་ནས་ནི།
en: “As they sever the bonds of affliction,

source: །ཀུན་ཀྱང་ལེན་པ་མ་མཆིས་པར།
en: They will all be free of clinging

source: །མྱུར་དུ་རབ་ཏུ་གྲོལ་འགྱུར་ཏེ།
en: And swiftly become liberated,

source: །དགེ་བ་མཆོག་གི་འབྲས་བུ་འཐོབ།
en: And thus attain the fruition of supreme virtue!

source: །དེ་དག་འཇིག་རྟེན་སྦྱིན་གནས་ཏེ།
en: “They will be objects of generosity in the world,

source: །སྦྱིན་པ་རྣམས་ནི་བླང་བའི་འོས།
en: Worthy of receiving gifts!

source: །དེ་དག་ཡོན་ཕུལ་མི་ཆུང་སྟེ།
en: Donations to them will not diminish,

source: །ཀུན་ཀྱང་མྱ་ངན་འདས་རྒྱུ་ལགས།
en: But become causes for all beings to reach nirvāṇa!”

source: །དགེ་སློང་དག་དེ་ལྟར་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། དེ་བཞིན་གཤེགས་པ་ལ་ཕྱག་འཚལ་ཞིང་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ།
en: Monks, once the gods from the realm of the pure realms had praised the Thus-Gone One in this manner, they prostrated to the Thus-Gone One with palms joined and stood to one side.

source: །དེ་ནས་འོད་གསལ་གྱི་ལྷའི་བུ་རྣམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བཞུགས་པ་ལ་མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བ་དན་རྣམ་པ་སྣ་ཚོགས་རྣམས་ཀྱིས་ཆོ་ག་བཞིན་དུ་མཆོད་ནས་ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Monks, then the luminous gods paid homage to the Thus-Gone One sitting at the seat of awakening with a plethora of flowers, incense, perfumes, garlands, unguents, parasols, standards, and flags. When the offerings had been made, they circumambulated him three times and then praised him with these verses:

source: །ཐུབ་པ་ཐུགས་ཟབ་གསུང་ནི་ཤིན་ཏུ་སྙན།
en: “Your mind is profound, O Sage, and your voice is sweet;

source: །ཐུབ་མཆོག་ཚངས་དབྱངས་གླུ་ལྟར་གསུང་སྙན་མཆོག །
en: O Supreme Sage, your song-like voice is melodious like Brahmā’s.

source: བྱང་ཆུབ་རབ་མཆོག་ཤིན་ཏུ་དམ་པ་བརྙེས།
en: You have discovered the absolute awakening, most sublime!
